## 3)  Column Selection and Indexing

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student.csv')
df

   Student_ID        Full_Name                   Major   GPA  Graduation_Year
0        1001    Liam Anderson        Computer Science  3.85             2026
1        1002  Sophia Martinez  Mechanical Engineering  3.62             2025
2        1003    Marcus Wright            Data Science  3.91             2027
3        1004    Isabella Chen                 Biology  3.74             2026
4        1005    Julian Brooks               Economics  3.45             2025
5        1006  Elena Rodriguez              Psychology  3.88             2026
6        1007     Oliver Quinn             Mathematics  3.95             2027

In [3]:
display(df['Student_ID'])

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
Name: Student_ID, dtype: int64

In [6]:
display(df[["Full_Name", "GPA"]])

         Full_Name   GPA
0    Liam Anderson  3.85
1  Sophia Martinez  3.62
2    Marcus Wright  3.91
3    Isabella Chen  3.74
4    Julian Brooks  3.45
5  Elena Rodriguez  3.88
6     Oliver Quinn  3.95